app/controllers/api/v1/bills_controller.rb

    def index
      @bills = Bill.all
---
SELECT "bills".* FROM "bills"

    def find_utility
      @utility = Utility.find(params[:utility_id])
---
SELECT  "utilities".* FROM "utilities" WHERE "utilities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]