app/controllers/api/v1/companies_controller.rb

SELECT "companies".* FROM "companies"
---
    def index
      @companies = Company.all