app/controllers/api/v1/utilities_controller.rb

    def index
      @utilities = Utility.all
---
SELECT "utilities".* FROM "utilities"

    def create
      @user = User.find(utility_params[:user_id])
      @company = Company.find_or_create_by(company_params)
        if @company.save
          # render json: @company, status: :accepted
          @utility = Utility.new(utility_params)
          @utility.company= @company
          @utility.user = @user
            if @utility.save
                # render json: @utility, status: :accepted
                  @bill = Bill.new(bill_params)
                  @bill.utility = @utility
                    if @bill.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "companies" ("name", "url", "logo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "utilities" ("company_id", "user_id", "utility_type", "start_date", "renewal_date", "payment_type", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "bills" ("utility_id", "bill_date", "cost", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["utility_id", 14], ["bill_date", "2019-04-03 23:00:00"], ["cost", 34], ["created_at", "2019-04-09 17:06:59.175688"], ["updated_at", "2019-04-09 17:06:59.175688"]]